Repository: MKEcoin/mkecoin-site
Catalog: _i18n/*/resources/user-guides/weblate/mkecoin-wallet-cli.po
Languages: ru

source: {% include disclaimer.html translated="no" translationOutdated="no" %}
ru: {% include disclaimer.html translated="yes" translationOutdated="no" %}

source: `MKEcoin-wallet-cli` is the wallet software that ships with the MKEcoin tree. It is a console program, and manages an account. While a bitcoin wallet manages both an account and the blockchain, MKEcoin separates these: `MKEcoind` handles the blockchain, and `MKEcoin-wallet-cli` handles the account.
ru: `MKEcoin-wallet-cli` - это программное обеспечение кошелька, которое поставляется вместе с MKEcoin. Оно представляет собой консольную программу, которая управляет учетными записями пользователей MKEcoin. В то время как кошелек Bitcoin управляет как учетными записями, так и блокчейном, в MKEcoin эти функции разделены: `MKEcoind` обрабатывает блокчейн, а `MKEcoin-wallet-cli` обрабатывает учетные записи пользователей.

source: This guide will show how to perform various operations from the `MKEcoin-wallet-cli` UI. The guide assumes you are using the most recent version of MKEcoin and have already created an account according to the other guides.
ru: В этом руководстве будет показано, как выполнять различные операции из пользовательского интерфейса `MKEcoin-wallet-cli`. В руководстве предполагается, что вы используете самую последнюю версию MKEcoin и уже создали учетную запись.

source: ## Checking your balance
ru: ## Проверяем свой баланс

source: Since the blockchain handling and the wallet are separate programs, many uses of `MKEcoin-wallet-cli` need to work with the @daemon. This includes looking for incoming transactions to your address. Once you are running both `MKEcoin-wallet-cli` and `MKEcoind`, enter `balance`.
ru: Поскольку обработка данных в блокчейне и учетных записей кошельков пользователей совершаются отдельными программами, многие функции `MKEcoin-wallet-cli` не будут функционировать без работающего демона. Одной из таких функций является поиск входящих транзакций на ваш адрес. Только когда вы запустите оба приложения, `MKEcoin-wallet-cli` и `MKEcoind`, сможете увидеть входящий баланс своего кошелька. Для этого введите команду `balance`.

source: Example:
ru: Пример:

source: This will pull blocks from the daemon the wallet did not yet see, and update your balance to match. This process will normally be done in the background every minute or so. To see the balance without refreshing:
ru: Эта команда синхронизирует блоки из демона, которые еще не «видел» кошелек, и обновит информацию о вашем поточном балансе, чтобы он соответствовал по времени текущему состоянию блокчейна. Этот процесс обычно выполняется автоматически в фоновом режиме каждую минуту или около того. Чтобы увидеть баланс без ожидания автоматического обновления:

source: In this example, `Balance` is your total balance. The `unlocked balance` is the amount currently available to spend. Newly received transactions require 10 confirmations on the blockchain before being unlocked. `unlocked dust` refers to very small amounts of unspent outputs that may have accumulated in your account.
ru: В этом примере `Balance` (Баланс) - это ваш текущий общий баланс. `Unlocked balance` (Разблокированный баланс) - это сумма, которую в настоящее время можно потратить. Недавно совершенные транзакции требуют 10 подтверждений в блокчейне перед разблокировкой. Разблокированная пыль (unlocked dust) относится к очень небольшим количествам неизрасходованных выходов, которые могут быть накоплены в процессе работы вашей учетной записи.

source: ## Sending MKEcoin
ru: ## Отправка MKEcoin

source: You will need the standard address you want to send to (a long string starting with '4'), and possibly a payment ID, if the receiving party requires one. In that latter case, that party may instead give you an integrated address, which is both of these packed into a single address.
ru: Вам понадобится `standart address` (Стандартный адрес), на который вы хотите отправить средства (длинная строка, начинающаяся с «4»), и, возможно, `payment id` (Идентификатор платежа), если принимающая сторона требует этого. В последнем случае принимающая сторона может вместо этого предоставить вам `integrated address` (Интегрированный адрес), который будет содержать в себе обе строки этих данных в упакованном виде в форме одного адреса.

source: ### Sending to a standard address:
ru: ### Отправка на стандартный адрес:

source: Replace `ADDRESS` with the address you want to send to, `AMOUNT` with how many MKEcoin you want to send, and `PAYMENTID` with the payment ID you were given. Payment ID's are optional. If the receiving party doesn't need one, just omit it.
ru: Вместо `ADDRESS` укажите адрес, на который вы хотите отправить средства, вместо `AMOUNT`, какое количество MKEcoin вы хотите отправить, и вместо `PAYMENTID` идентификатор платежа, который вы получили. Идентификаторы платежей являются необязательными. Если принимающая сторона не нуждается в них, просто не вводите ничего.

source: ### Sending to an integrated address:
ru: ### Отправка на интегрированный адрес:

source: The payment ID is implicit in the integrated address in that case.
ru: Идентификатор платежа в этом случае находится внутри интегрированного адреса.

source: ### Specify the number of outputs for a transaction:
ru: ### Указываем количество выходов для транзакции (размер кольца):

source: Replace `RINGSIZE` with the number of outputs you wish to use. **If not specified, the default is 11.** It's a good idea to use the default, but you can increase the number if you want to include more outputs. The higher the number, the larger the transaction, and higher fees are needed.
ru: Вместо `RINGSIZE` укажите количество выходов, которые вы хотите использовать. Если параметр не указан, **по умолчанию будет использоваться значение 11.** Рекомендуется использовать значение по умолчанию, но вы можете увеличить это число, если хотите добавить больше выходов. Чем выше число, тем больше по размеру транзакция и более высокие комиссии.

source: ## Receiving MKEcoin
ru: ## Получение MKEcoin

source: If you have your own MKEcoin address, you just need to give your standard address to someone.
ru: Если у вас есть собственный кошелек MKEcoin, для получения средств на него вам просто нужно предоставить кому-то свой стандартный адрес.

source: You can find out your address with:
ru: Вы можете узнать свой стандартный адрес, если введете команду:

source: Since MKEcoin is anonymous, you won't see the origin address the funds you receive came from. If you want to know, for instance to credit a particular customer, you'll have to tell the sender to use a payment ID, which is an arbitrary optional tag which gets attached to a transaction. To make life easier, you can generate an address that already includes a random payment ID:
ru: Поскольку MKEcoin анонимная криптовалюта, вы не увидите адрес источника, из которого вы получили свои средства. Если вам нужно знать эти данные, например, для кредитования конкретного клиента, вам нужно будет договориться с отправителем, чтобы он использовал идентификатор платежа, который является произвольным необязательным тегом, который привязывается к транзакции. Чтобы упростить себе жизнь, вы можете создать интегрированный адрес, который уже содержит этот случайный идентификатор платежа:

source: This will generate a random payment ID, and give you the address that includes your own account and that payment ID. If you want to select a particular payment ID, you can do that too:
ru: Это создаст случайный идентификатор платежа и предоставит вам адрес, который будет включать ваш стандартный адрес и этот идентификатор платежа. Если вы хотите выбрать конкретный идентификатор платежа, вы также можете это сделать с помощью команды:

source: Payments made to an integrated address generated from your account will go to your account, with that payment id attached, so you can tell payments apart.
ru: Платежи, внесенные в интегрированный адрес, созданный в вашей учетной записи, будут отправляться вам с прикрепленным идентификатором платежа, чтобы вы могли вести их учет отдельно.

source: ## Proving to a third party you paid someone
ru: ## Как доказать третьей стороне, что вы заплатили кому-то

source: If you pay a merchant, and the merchant claims to not have received the funds, you may need to prove to a third party you did send the funds - or even to the merchant, if it is a honest mistake. MKEcoin is private, so you can't just point to your transaction in the blockchain, as you can't tell who sent it, and who received it. However, by supplying the per-transaction private key to a party, that party can tell whether that transaction sent MKEcoin to that particular address. Note that storing these per-transaction keys is disabled by default, and you will have to enable it before sending, if you think you may need it:
ru: Если вы платите субъекту, а он заявляет, что не получил средств, вам может потребоваться доказать третьему лицу, которому вы отправляли средства, или даже самому субъекту, что платеж был действительно отправлен. MKEcoin является конфиденциальной сетью, поэтому вы не можете просто указать на свою транзакцию в блокчейне, так как вы не можете сказать, кто ее отправил, и кто ее получил. Однако существует возможность предоставлять `tx key` (Ключ транзакций) третьей стороне, а эта сторона уже сможет определить, была ли отправлена эта транзакция MKEcoin этому конкретному адресу. Обратите внимание, что сохранение этих ключей для каждой транзакции отключено по умолчанию, и вам нужно будет включить его перед отправкой, если вы считаете, что вам может понадобиться данная функция. Делается это с помощью команды:

source: You can retrieve the tx key from an earlier transaction:
ru: Вы можете извлечь `tx key` (Ключ транзакций) из более ранней транзакции:

source: Pass in the transaction ID you want the key for. Remember that a payment might have been split in more than one transaction, so you may need several keys. You can then send that key, or these keys, to whoever you want to provide proof of your transaction, along with the transaction id and the address you sent to. Note that this third party, if knowing your own address, will be able to see how much change was returned to you as well.
ru: Введите идентификатор транзакции, для которого вы хотите узнать ключ. Помните, что платеж мог быть разделен более чем на одну транзакцию, поэтому вам может понадобиться несколько ключей для каждой транзакции. Затем вы можете отправить этот ключ или ключи кому-либо, кому вы хотите предоставить подтверждение совершения своей транзакции, а также идентификатор транзакции и адрес, на который вы отправили средства. Обратите внимание, что эта третья сторона, зная свой собственный адрес, и эти данные сможет узнать, какие именно средства вы ей отправили.

source: If you are the third party (that is, someone wants to prove to you that they sent MKEcoin to an address), then you can check this way:
ru: Если вы являетесь третьей стороной (то есть кто-то хочет доказать вам, что отправил MKEcoin на ваш адрес), вы можете проверить это таким способом:

source: Replace `TXID`, `TXKEY` and `ADDRESS` with the transaction ID, per-transaction key, and destination address which were supplied to you, respectively. MKEcoin-wallet-cli will check that transaction and let you know how much MKEcoin this transaction paid to the given address.
ru: Укажите вместо `TXID`, `TXKEY` и `ADDRESS` соответственно идентификатор транзакции, ключ транзакции и адрес получателя, которые были предоставлен вам. MKEcoin-wallet-cli проверит эту транзакцию и сообщит вам, сколько денег было оплачено этой транзакцией по указанному адресу.

source: ## Getting a chance to confirm/cancel payments
ru: ## Включение опции подтвердить/отменить платеж

source: If you want to get a last chance confirmation when sending a payment:
ru: Если вы всегда хотите вручную перед отправкой подтверждать (yes/no) каждый платеж, введите команду:

source: ## How to find a payment to you
ru: ## Как найти отправленный вам платеж

source: If you received a payment using a particular payment ID, you can look it up:
ru: Если вы получили платеж с использованием определенного `payment id` (Идентификатор платежа), вы можете посмотреть информацию об этом с помощью команды:

source: You can give more than one payment ID too.
ru: Вы также можете указать более одного идентификатора платежа.

source: More generally, you can review incoming and outgoing payments:
ru: В более общем плане вы можете просматривать информацию обо всех входящих и исходящих платежах, если введете команду:

source: You can give an optional height to list only recent transactions, and request only incoming or outgoing transactions. For example,
ru: Вы можете дополнительно указать высоту блока, чтобы отображать только последние транзакции и запрашивать только входящие или исходящие транзакции. Например, команда:

source: will only show incoming transfers after block 650000. You can also give a height range.
ru: покажет только входящие транзакции после блока 650000. Вы также можете указывать диапазоны высоты блоков.

source: If you want to mine, you can do so from the wallet:
ru: Если вы хотите запустить фоновый майнинг, то можете сделать это прямо из кошелька командой:

source: This will start mining on the daemon usin two threads. Note that this is solo mining, and may take a while before you find a block. To stop mining:
ru: Это запустит майнинг на демоне в 2 потока. Обратите внимание, что это соло-майнинг, и может потребоваться очень длительное время, прежде чем вы найдете блок. Чтобы остановить майнинг, введите команду:
