Repository: MKEcoin/mkecoin-site
Catalog: _i18n/*/resources/user-guides/weblate/verification-allos-advanced.po
Languages: ar, fr, nb_no, nl, ru

source: {% include disclaimer.html translated="no" translationOutdated="no" %}
ar: {% include disclaimer.html translated="yes" translationOutdated="no" %}
fr: {% include disclaimer.html translated="yes" translationOutdated="no" %}
nb_no: {% include disclaimer.html translated="yes" translationOutdated="no" %}
nl: {% include disclaimer.html translated="yes" translationOutdated="yes" %}
ru: {% include disclaimer.html translated="yes" translationOutdated="no" %}

source: Verification of the MKEcoin binary files should be done prior to extracting, installing, or using the MKEcoin software. This is the only way to ensure that you are using the official MKEcoin software. If you receive a fake MKEcoin binary (eg. phishing, MITM, etc.), following this guide will protect you from being tricked into using it.
ar: التأكد من صحه ملفات التثبيت يجب أن يكون قبل فك الضغط أو التثبيت أو إستخدام البرامج. هذه هي الطريقه الوحيده للتأكد من حصولك علي البرامج الرسميه. إذا حصلت علي ملفات تثبيت مزيفه ( مثال هجمات التصيد و إختراق الإتصال وخلافه) بمتابعه هذا لدليل سوف تحمي نفسك من الوقوع ضحيه لهذه الملفات.
fr: Les fichiers binaires MKEcoin devrait être vérifiés avant extraction, installation ou utilisation de l'application MKEcoin. C'est l'unique manière de vous assurer que vous utilisez le binaire officiel MKEcoin. Si vous recevez un binaire contrefait (p. ex. hameçonnage, HDM, etc.), suivre ce guide vous évitera de vous faire piéger.
nb_no: Verifisering av MKEcoin-binærfilene bør gjøres i forkant av utpakking, installering eller bruk av MKEcoin-programvaren. Dette er den eneste måten å sikre at du bruker den offisielle MKEcoin-programvaren. Hvis du mottar en falsk MKEcoin-binærfil (f.eks. phishing, MITM osv.), vil denne veiledningen hindre deg fra å bli lurt til å bruke den.
nl: Voordat je de MKEcoin-software uitpakt, installeert en gebruikt, moet je de binaire bestanden van MKEcoin verifiëren. Dit is de enige manier om er zeker van te zijn dat je de officiële MKEcoin-software gebruikt. Als je een onecht MKEcoin-binary ontvangt (bijvoorbeeld via phishing of een *man-in-the-middle attack*), voorkomt deze methode dat je er gebruik van maakt.
ru: Верификация двоичных файлов MKEcoin производится до извлечения, установки или использования программного обеспечения MKEcoin. Это единственный способ убедиться в том, что вы используете официальное программное обеспечение MKEcoin. Если вами был получен поддельный двоичный файл MKEcoin (например, фишинговый, MITM и т. д.), соблюдение правил, изложенных в данном руководстве, поможет избежать обмана, связанного с использованием такого файла.

source: To protect the integrity of the binaries the MKEcoin team provides a cryptographically signed list of all the [SHA256](https://en.wikipedia.org/wiki/SHA-2) hashes. If your downloaded binary has been tampered with it will be produce a [different hash](https://en.wikipedia.org/wiki/File_verification) than the one in the file.
ar: لحماية تكامل الثنائيات ، يوفر فريق مونيرو قائمة موقعة مشفرة لكل الملفات [SHA256] (https://en.wikipedia.org/wiki/SHA-2). إذا تم العبث بالملف الذي تم تنزيله ، فسيتم إنتاجه [هاش مختلف] (https://en.wikipedia.org/wiki/File_verification) عن الموجود في الملف.
fr: Pour protéger l'intégrité des binaires, l'équipe MKEcoin fournit une liste cryptographiquement signée de tous les hachages [SHA256](https://en.wikipedia.org/wiki/SHA-2). Si le binaire que vous avez téléchargé a été altéré il produira un [hachage différent](https://en.wikipedia.org/wiki/File_verification) de celui fourni dans le fichier.
nb_no: For å beskytte integriteten til binærfilene, gir MKEcoin-teamet en kryptografisk signert liste over alle [SHA256](https://en.wikipedia.org/wiki/SHA-2)-hashene. Hvis din nedlastede binærfil har blitt tuklet med, produserer den en [forskjellig hash](https://en.wikipedia.org/wiki/File_verification) enn den i filen.
nl: Het MKEcoin-team stelt een cryptografisch ondertekende lijst beschikbaar met alle [SHA256](https://en.wikipedia.org/wiki/SHA-2)-hashes, om de integriteit van de binaries te garanderen. Als er met het gedownloade binaire bestand is geknoeid, levert het een [andere hash](https://nl.wikipedia.org/wiki/Hashfunctie) op dan in de lijst.
ru: Для защиты целостности двоичных файлов команда MKEcoin обеспечивает криптографически подписанный список всех хешей [SHA256](https://en.wikipedia.org/wiki/SHA-2) Если загруженный вами двоичный файл был изменён, он будет выдавать хеш, [отличающийся](https://en.wikipedia.org/wiki/File_verification) от того, что находится в файле.

source: This is an advanced guide for Linux, Mac, or Windows operating systems and will make use of the command line. It will walk you through the process of installing the required software, importing the signing key, downloading the necessary files, and finally verifying that your binary is authentic.
ar: هذا دليل متقدم يستخدم سطر الأوامر لنُظم تشغيل لينُكس وويندوز وماك سيوجهك خلال عملية تثبيت البرامج المطلوبه واستيراد مفتاح التوقيع وتنزيل الملفات الضرورية وأخيرًا التحقق من صحة ملفات التثبيت.
fr: Voici un guide avancé pour les systèmes d'exploitation Linux, Mac et Windows qui s'appuiera sur des lignes de commandes (CLI). Il couvrira tout le processus d'installation des applications requises, d'import de la clef de signature, de téléchargement des fichiers nécessaires et enfin de vérification de l'authenticité de votre binaire.
nb_no: Dette er en avansert veiledning for Linux, Mac, eller Windows som gjør bruk at kommandolinjen. Den leder deg gjennom prosessen av å installere den nødvendige programvaren, importering av signaturnøkkelen, nedlasting av de nødvendige filene, og til slutt verifisering av at binærfilene dine er autentiske.
nl: Dit is een geavanceerde handleiding voor de besturingssystemen Linux, Mac en Windows. Hierbij wordt de opdrachtregel gebruikt. We leggen stap voor stap uit hoe je de vereiste software installeert, de ondertekeningssleutel importeert, de benodigde bestanden downloadt en uiteindelijk verifieert dat je binaire bestand authentiek is.
ru: Это руководство для продвинутых пользователей операционных систем Linux, Mac и Windows, которое подразумевает использование командной строки. В нём подробно рассматривается процесс установки необходимого программного обеспечения, импорта ключа подписи, загрузки необходимых файлов и, наконец, проверки аутентичности ваших двоичных файлов.

source: ## Table of Contents:
ar: ## قائمه المحتوي:
fr: ## Table des matières
nb_no: ## Innholdsfortegnelse:
nl: ## Inhoud
ru: ## Содержание:

source: ### [1. Install GnuPG](#1-installing-gnupg) ### [2. Verify & Import Signing Key](#2-verify-and-import-signing-key) + [2.1. Get Signing Key](#21-get-signing-key) + [2.2. Verify Signing key](#22-verify-signing-key) + [2.3. Import Signing key](#23-import-signing-key) ### [3. Download & Verify Hash File](#3-download-and-verify-hash-file) + [3.1. Get Hash File](#31-get-hash-file) + [3.2. Verify Hash File](#32-verify-hash-file) ### [4. Download & Verify Binary](#4-download-and-verify-binary) + [4.1. Get MKEcoin Binary](#41-get-MKEcoin-binary) + [4.2. Binary Verification on Linux or Mac](#42-binary-verification-on-linux-or-mac) + [4.3. Binary Verification on Windows](#43-binary-verification-on-windows)
ar: ### [1. تثبيت GnuPG](#1-installing-gnupg) ### [2. تأكيد & إستيراد ملف مفتاح التوقيع](#2-verify-and-import-signing-key) + [2.1. إحصل علي مفتاح التوقيع ](#21-get-signing-key) + [2.2. تأكد من مفتاح التوقيع ](#22-verify-signing-key) + [2.3. إستيراد مفتاح التوقيع ](#23-import-signing-key) ### [3. تنزيل & تأكد من ملف الهاش](#3-download-and-verify-hash-file) + [3.1. إحصل علي ملف الهاش ](#31-get-hash-file) + [3.2. تأكد من ملف الهاش ](#32-verify-hash-file) ### [4. تحميل & تأكد من ملفات التسطيب ](#4-download-and-verify-binary) + [4.1. الحصول علي ملفات التسطيب](#41-get-MKEcoin-binary) + [4.2. تأكد من الملفات علي ليُنكس اوماك ](#42-binary-verification-on-linux-or-mac) + [4.3. تأكد من الملفات علي ويندوز](#43-binary-verification-on-windows)
fr: ### [1. Installer GnuPG](#1-installation-de-gnupg) ### [2. Vérifier & Importer la Clef de Signature](#2-vérifier-et-importer-la-clef-de-signature) + [2.1. Obtenir la Clef de Signature](#21-obtenir-la-clef-de-signature) + [2.2. Vérifier la Clef de Signature](#22-vérifier-la-clef-de-signature) + [2.3. Importer la Clef de Signature](#23-importer-la-clef-de-signature) ### [3. Télécharger & Vérifier le Fichier de Hachage](#3-télécharger-et-vérifier-le-fichier-de-hachage) + [3.1. Télécharger le Fichier de Hachage](#31-télécharger-le-fichier-de-hachage) + [3.2. Vérifier le Fichier de Hachage](#32-vérifier-le-fichier-de-hachage) ### [4.Télécharger & Vérifier les binaires](#4-télécharger-et-vérifier-les-binaires) + [4.1. Télécharger les binaires MKEcoin](#41-télécharger-les-binaires-MKEcoin) + [4.2. Vérifier les binaires sur Linux et Mac](#42-vérifier-les-binaires-sur-linux-et-mac) + [4.3. Vérifier les binaires sur Windows](#43-vérifier-les-binaires-sur-windows)
nb_no: ### [1. Installering av GnuPG](#1-installing-gnupg) ### [2. Verifisering og import av signaturnøkkel](#2-verify-and-import-signing-key) + [2.1. Å få tak i signaturnøkkel](#21-get-signing-key) + [2.2. Verifisering av signaturnøkkel](#22-verify-signing-key) + [2.3. Import av signaturnøkkel](#23-import-signing-key) ### [3. Nedlasting og verifisering av hash-fil](#3-download-and-verify-hash-file) + [3.1. Å få tak i hashfilen](#31-get-hash-file) + [3.2. Verifisering av hashfil](#32-verify-hash-file) ### [4. Nedlasting og verifisering av binærfiler](#4-download-and-verify-binary) + [4.1. Å få tak i MKEcoin-binærfiler](#41-get-MKEcoin-binary) + [4.2. Verifisering av binærfiler på Linux eller Mac](#42-binary-verification-on-linux-or-mac) + [4.3. Verifisering av binærfiler på Windows](#43-binary-verification-on-windows)
nl: ### [1. GnuPG installeren](#1-installing-gnupg) ### [2. Ondertekeningssleutel verifiëren en importeren](#2-verify-and-import-signing-key) + [2.1. Ondertekeningssleutel ophalen](#21-get-signing-key) + [2.2. Ondertekeningssleutel verifiëren](#22-verify-signing-key) + [2.3. Ondertekeningssleutel importeren](#23-import-signing-key) ### [3. Hashbestand downloaden en verifiëren](#3-download-and-verify-hash-file) + [3.1. Hashbestand ophalen](#31-get-hash-file) + [3.2. Hashbestand verifiëren](#32-verify-hash-file) ### [4. Binary downloaden en verifiëren](#4-download-and-verify-binary) + [4.1. MKEcoin-binary ophalen](#41-get-MKEcoin-binary) + [4.2. Binary verifiëren op Linux of Mac](#42-binary-verification-on-linux-or-mac) + [4.3. Binary verifiëren op Windows](#43-binary-verification-on-windows)
ru: ### [1. Установка GnuPG](#1-installing-gnupg) ### [2. Верификация и импорт ключа подписи](#2-verify-and-import-signing-key) + [2.1. Получение ключа подписи](#21-get-signing-key) + [2.2. Верификация ключа подписи](#22-verify-signing-key) + [2.3. Импорт ключа подписи](#23-import-signing-key) ### [3. Загрузка и верификация хеш-файла](#3-download-and-verify-hash-file) + [3.1. Получение хеш-файла](#31-get-hash-file) + [3.2. Верификация хеш-файла](#32-verify-hash-file) ### [4. Download & Verify Binary](#4-download-and-verify-binary) + [4.1. Получение двоичного файла MKEcoin](#41-get-MKEcoin-binary) + [4.2. Верификация двоичного файла под Linux и Mac](#42-binary-verification-on-linux-or-mac) + [4.3. Верификация двоичного файла под Windows](#43-binary-verification-on-windows)

source: ## 1. Installing GnuPG
ar: ## 1. تثبيت GnuPG
fr: ## 1. Installation de GnuPG
nb_no: ## 1. Installering av GnuPG
nl: ## 1. GnuPG installeren
ru: ## 1. Установка GnuPG

source: + On Windows, go to the [Gpg4win download page](https://gpg4win.org/download.html) and follow the instructions for installation.
ar: + في ويندوز انتقل إلى صفحة التنزيل [Gpg4win] (https://gpg4win.org/download.html) واتبع الإرشادات الخاصة بالتثبيت.
fr: + Sur Windows, rendez-vous sur la [page de téléchargement de Gpg4win](https://gpg4win.org/download.html) et suivez les instructions d'installation.
nb_no: + På Windows, gå til [Gpg4win-nedlastingssiden](https://gpg4win.org/download.html) og følg anvisningene for installasjon.
nl: + Op Windows ga je naar de [downloadpagina voor Gpg4win](https://gpg4win.org/download.html) en volg je de instructies voor het installeren.
ru: + Для Windows: посетите [страницу загрузки Gpg4win](https://gpg4win.org/download.html) и следуйте инструкциям по установке.

source: + On Mac, go to the [Gpgtools download page](https://gpgtools.org/) and follow the instructions for installation.
ar: + في ماك انتقل إلى صفحة تنزيل [Gpgtools] (https://gpgtools.org/) واتبع الإرشادات الخاصة بالتثبيت.
fr: + Sur Mac, rendez-vous sur la [page de téléchargement de Gpgtools](https://gpgtools.org/) et suivez les instructions d'installation.
nb_no: + På Mac, gå til [Gpgtools-nedlastingssiden](https://gpgtools.org/) og følg anvisningene for installasjon.
nl: + Op een Mac ga je naar de [downloadpagina voor Gpgtools](https://gpgtools.org/) en volg je de instructies voor het installeren.
ru: + Для Mac: посетите [страницу загрузки Gpgtools](https://gpgtools.org/) и следуйте инструкциям по установке.

source: + On Linux, GnuPG is installed by default.
ar: + في ليُنكس ، GnuPG مُثبّت افتراضيًا.
fr: + Sur Linux, GnuPG est installé par défaut.
nb_no: + GnuPG installert som standard på Linux.
nl: + Op Linux is GnuPG standaard geïnstalleerd.
ru: + Для Linux: GnuPG устанавливается по умолчанию.

source: ## 2. Verify and Import Signing Key
ar: ## 2. تأكيد & إستيراد ملف مفتاح التوقيع
fr: ## 2. Vérifier et Importer la Clef de Signature
nb_no: ## 2. Verifisering og import av signaturnøkkel
nl: ## 2. Ondertekeningssleutel verifiëren en importeren
ru: ## 2. Верификация и импорт ключа подписи

source: This section will cover getting the MKEcoin signing key, making sure it is correct, and importing the key to GnuPG.
ar: سيغطي هذا القسم الحصول على مفتاح توقيع مونيرو والتأكد من صحته واستيراد المفتاح إلى GnuPG.
fr: Cette rubrique couvre le téléchargement de la clef de signature MKEcoin, la vérification que cette clef est correcte et l'import de la clef dans GnuPG.
nb_no: Denne delen tar for seg hvordan man får tak i MKEcoin-signaturnøkkelen, hvordan man sikrer at den er riktig og hvordan man importerer nøkkelen til GnuPG.
nl: In dit gedeelte leggen we uit hoe je de MKEcoin-ondertekeningssleutel ophaalt, controleert of deze correct is en de sleutel importeert in GnuPG.
ru: В данном разделе будет рассмотрен вопрос получения ключа подписи MKEcoin, проверки его правильности и импорта ключа в GnuPG.

source: ### 2.1. Get Signing Key
ar: ### 2.1. إحصل علي مفتاح التوقيع
fr: ### 2.1. Obtenir la Clef de Signature
nb_no: ### 2.1. Å få tak i signaturnøkkelen
nl: ### 2.1. Ondertekeningssleutel ophalen
ru: ### 2.1. Получение ключа подписи

source: On Windows or Mac, go to [binaryFate's GPG key](https://raw.githubusercontent.com/MKEcoin-project/MKEcoin/master/utils/gpg_keys/binaryfate.asc), which he uses to sign the MKEcoin binaries, and save the page as `binaryfate.asc` to your home directory.
ar: علي ويندوز أو ماك إذهب إلي [binaryFate's GPG key](https://raw.githubusercontent.com/MKEcoin-project/MKEcoin/master/utils/gpg_keys/binaryfate.asc) لتحميل المُفتاح المُستخدم في توقيع الملفات وقم بحفظه بإسم `binaryfate.asc` في مجلدك الرئيسي.
fr: Sur Windows et Mac, rendez-vous sur [la clef GPG de binaryFate](https://raw.githubusercontent.com/MKEcoin-project/MKEcoin/master/utils/gpg_keys/binaryfate.asc), qu'il utilise pour signer les binaires MKEcoin et sauvegardez la page sous `binaryfate.asc` dans votre répertoire utilisateur.
nb_no: På Windows eller Mac, gå til [binaryFates GPG key](https://raw.githubusercontent.com/MKEcoin-project/MKEcoin/master/utils/gpg_keys/binaryfate.asc), som han bruker til å signere MKEcoin-binærfilene, og lagre siden som `binaryfate.asc` til hjemkatalogen din.
nl: Op Windows of een Mac: ga naar [Fluffypony's GPG-sleutel](https://raw.githubusercontent.com/MKEcoin-project/MKEcoin/master/utils/gpg_keys/binaryfate.asc), waarmee hij de MKEcoin-binaries ondertekent, en sla de pagina op als `binaryfate.asc` in je homedirectory.
ru: Для Windows или Mac можно взять [GPG ключ binaryfate](https://raw.githubusercontent.com/MKEcoin-project/MKEcoin/master/utils/gpg_keys/binaryfate.asc), оторый он использует для подписи двоичных файлов MKEcoin, и сохранить страницу как `fluffypony.asc` в вашей исходной, «домашней» директории.

source: On Linux, you can download binaryFate's signing key by issuing the following command:
ar: في ليُنكس يمكنك تحميل ملف مفتاح التوقيع من خلال الأمر التالي :
fr: Sur Linux, vous pouvez télécharger la clef de signature de Fluffypony en tapant la commande suivante :
nb_no: På Linux kan du laste ned binaryFates signaturnøkkel ved å eksekvere følgende kommando:
nl: Op Linux kun je de ondertekeningssleutel van binaryFate downloaden door de volgende opdracht op te geven:
ru: Для Linux можно загрузить ключ подписи binaryfate, используя следующую команду:

source: ### 2.2. Verify Signing Key
ar: ### 2.2. تأكد من مفتاح التوقيع
fr: ### 2.2. Vérifier la Clef de Signature
nb_no: ### 2.2. Verifisering av signaturnøkkel
nl: ### 2.2. Ondertekeningssleutel verifiëren
ru: ### 2.2. Верификация ключа подписи

source: On all operating systems, check the fingerprint of `binaryfate.asc` by issuing the following command in a terminal:
ar: في جميع أنظمة التشغيل ، تحقق من بصمة `binaryfate.asc` بإصدار الأمر التالي في سطر الأوامر :
fr: Sur l'ensemble des systèmes d'exploitation, vérifiez l'empreinte de `binaryfate.asc` en tapant la commande suivante dans un terminal :
nb_no: På alle operativsystemer, kan du sjekke fingeravtrykket til `binaryfate.asc` ved å eksekvere følgende kommando i en terminal:
nl: Op alle besturingssystemen kun je de vingerafdruk van `binaryfate.asc` controleren door de volgende opdracht te geven in een terminal:
ru: В случае со всеми операционными системами следует проверить отпечаток в `binaryfate.asc` используя следующую команду в консоли:

source: Verify the fingerprint matches:
ar: تحقق من تطابق البصمه بالتالي :
fr: Vérifiez que l'empreinte est bien :
nb_no: Verifiser fingeravtrykkene:
nl: Controleer of de vingerafdruk overeenkomt:
ru: Следует проверить совпадение отпечатков:

source: If the fingerprint **DOES** match, then you may proceed.
ar: إذا كانت البصمه **صحيحه** يمكنك المُتابعه.
fr: Si l'empreinte **EST** identique, vous pouvez continuer.
nb_no: Dersom fingeravtrykket **MATCHER**, kan du fortsette.
nl: Als de vingerafdruk **WEL** overeenkomt, kun je verder gaan.
ru: Если отпечаток **СОВПАДЕТ**, можно продолжать.

source: If the fingerprint **DOES NOT** match, **DO NOT CONTINUE.** Instead delete the file `binaryfate.asc` and go back to [section 2.1](#21-get-signing-key).
ar: إذا كانت البصمه ** غير متطابقه ** **لا تُكمل** بل قم بحذف ملف `binaryfate.asc` وإذهب إلي [فصل 2.1](#21-get-signing-key).
fr: Si l'empreinte **N'EST PAS** identique, **NE POURSUIVEZ PAS.** Au lieu de cela, supprimez le fichier `binaryfate.asc` et retournez à la [rubrique 2.1](#21-obtenir-la-clef-de-signature).
nb_no: Dersom fingeravtrykket **IKKE MATCHER**, **IKKE FORTSETT.** Slett istedenfor `binaryfate.asc`-filen og gå tilbake til [seksjon 2.1](#21-get-signing-key).
nl: **GA NIET VERDER** als de vingerafdruk **NIET** overeenkomt. Verwijder dan het bestand `binaryfate.asc` en ga terug naar [paragraaf 2.1](#21-get-signing-key).
ru: В случае **НЕСОВПАДЕНИЯ** отпечатка, **ПРОДОЛЖАТЬ НЕ СЛЕДУЕТ**. Вместо этого необходимо удалить файл `binaryfate.asc` и вернуться к [пункту 2.1](#21-get-signing-key).

source: ### 2.3. Import Signing Key
ar: ### 2.3. إستيراد مفتاح التوقيع
fr: ### 2.3. Importer la Clef de Signature
nb_no: ### 2.3. Import av signaturnøkkel
nl: ### 2.3. Ondertekeningssleutel importeren
ru: ### 2.3. Импорт ключа подписи

source: From a terminal, import the signing key:
ar: من سطر الأوامر ، قم باستيراد مفتاح التوقيع:
fr: Depuis un terminal, importez la clef de signature :
nb_no: Fra en terminal, importer signaturnøkkel:
nl: Importeer de ondertekeningssleutel in een terminal:
ru: Используя консоль, импортировать ключ подписи:

source: If this is the first time you have imported the key, the output will look like this:
ar: إذا كانت هذه هي المرة الأولى التي تستورد فيها المفتاح ، فسيبدو الناتج كما يلي:
fr: Si c'est la première fois que vous importez la clef, la sortie ressemblera à ceci :
nb_no: Hvis dette er første gang du har importert nøkkelen, vil utdataen se ut noe som dette:
nl: Als dit de eerste keer is dat je de sleutel hebt geïmporteerd, ziet de uitvoer er als volgt uit:
ru: Если ключ импортируется впервые, выход должен выглядеть так:

source: If you have imported the key previously, the output will look like this:
ar: إذا قمت باستيراد المفتاح مسبقًا ، فسيبدو الناتج كما يلي:
fr: Si vous avez déjà importé la clef précédemment, la sortie ressemblera à cela :
nb_no: Hvis du tidligere har importert nøkkelen, vil utdataen se slik ut:
nl: Als je de sleutel eerder hebt geïmporteerd, ziet de uitvoer er als volgt uit:
ru: Если же ключ импортировался до этого, то выход будет следующим:

source: ## 3. Download and Verify Hash File
ar: ## 3. تنزيل & تأكد من ملف الهاش
fr: ## 3. Télécharger et Vérifier le Fichier de Hachage
nb_no: ## 3. Nedlasting og verifisering av hashfil
nl: ## 3. Hashbestand downloaden en verifiëren
ru: ## 3. Загрузка и верификация хеш-файла

source: This section will cover downloading the hash file and verifying its authenticity.
ar: سيغطي هذا القسم تنزيل ملف الهاش والتحقق من صحته.
fr: Cette rubrique couvre le téléchargement du fichier signé des hachages valides et la vérification de son authenticité.
nb_no: Denne delen tar for seg nedlasting av hash-filen og å verifisere at den er autentisk.
nl: In dit gedeelte leggen we uit hoe je het hashbestand downloadt en de authenticiteit verifieert.
ru: В данном разделе рассматривается вопрос загрузки хеш-файла и проверки его аутентичности.

source: ### 3.1. Get Hash File
ar: ### 3.1. إحصل علي ملف الهاش
fr: ### 3.1. Télécharger le Fichier de Hachage
nb_no: ### 3.1. Å få ta i hashfilen
nl: ### 3.1. Hashbestand ophalen
ru: ### 3.1. Получение хеш-файла

source: On Windows or Mac, go to the [hashes file on getMKEcoin.org]({{ site.baseurl_root }}/downloads/hashes.txt) and save the page as `hashes.txt` to your home directory.
ar: على نظام ويندوز أو ماك انتقل إلى [ملف الهاشات على getMKEcoin.org] ({{ site.baseurl }}/downloads/hashes.txt) واحفظ الصفحة كـ `hashes.txt` إلى مجلدك الرئيسي.
fr: Sur Windows et Mac, rendez-vous sur sur la [page de haches getMKEcoin.org](https://getMKEcoin.org/fr/downloads/hashes.txt) et sauvegardez la page sous `hashes.txt` dans votre répertoire utilisateur.
nb_no: På Windows eller Mac, gå til [hashes-filen på getMKEcoin.org]({{ site.baseurl_root }}/downloads/hashes.txt) og lagre siden som `hashes.txt` til hjemkatalogen.
nl: Op Windows of een Mac ga je naar het [hashbestand op getMKEcoin.org]({{ site.baseurl }}/downloads/hashes.txt) en sla je de pagina op als `hashes.txt` in je homedirectory.
ru: В том случае, если установлена операционная система Windows или Mac, следует перейти на страницу [хеш-файлов на getMKEcoin.org]({{ site.baseurl_root }}/downloads/hashes.txt) и сохранить её в своей домашней директории как `hashes.txt`.

source: On Linux, you can download the signed hashes file by issuing the following command:
ar: في ليُنكس يمكنك تنزيل ملف الهاشات الموقّع عن طريق إصدار الأمر التالي:
fr: Sur Linux, vous pouvez télécharger le fichier de hachage en tapant la commande suivante :
nb_no: På Linux kan du laste ned filen med de signerte hashene ved å eksekvere følgende kommando:
nl: Op Linux kun je het ondertekende hashbestand downloaden door de volgende opdracht op te geven:
ru: В том случае, если используется Linux, можно загрузить подписанный хеш-файл, используя следующую команду:
