Repository: MKEcoin/mkecoin-site
Catalog: _i18n/*/resources/user-guides/weblate/verification-allos-advanced.po
Languages: ar, fr, nb_no, nl, ru

source: ### 3.2. Verify Hash File
ar: ### 3.2. تأكد من ملف الهاش
fr: ### 3.2. Vérifier le Fichier de Hachage
nb_no: ### 3.2. Verifsering av hashfilen
nl: ### 3.2. Hashbestand verifiëren
ru: ### 3.2. Верификация хеш-файла

source: The hash file is signed with key `81AC 591F E9C4 B65C 5806 AFC3 F0AF 4D46 2A0B DF92`, as reflected in the output below.
ar: ملف الهاش موقع بمفتاح `81AC 591F E9C4 B65C 5806 AFC3 F0AF 4D46 2A0B DF92`, كما هو موضح في الناتج أدناه.
fr: Le fichier de hachage est signé avec la clef `81AC 591F E9C4 B65C 5806 AFC3 F0AF 4D46 2A0B DF92`, comme vous pouvez le voir dans la sortie ci-dessous.
nb_no: Hashfilen signeres med nøkkelen `81AC 591F E9C4 B65C 5806 AFC3 F0AF 4D46 2A0B DF92`, som det framgår i utdataen under.
nl: Het hashbestand is ondertekend met de sleutel `81AC 591F E9C4 B65C 5806 AFC3 F0AF 4D46 2A0B DF92`, zoals weergegeven in de uitvoer hieronder.
ru: Хеш-файл подписывается ключом `81AC 591F E9C4 B65C 5806 AFC3 F0AF 4D46 2A0B DF92`, что видно в выходе ниже.

source: On all operating systems, verify the signature of the hash file by issuing the following command in a terminal:
ar: في جميع أنظمة التشغيل ، تحقق من توقيع ملف التجزئة عن طريق إصدار الأمر التالي في سطر الأوامر:
fr: Sur tous les systèmes d'exploitations, vérifiez la signature du fichier de hachage en tapant la commande suivante dans un terminal :
nb_no: På alle operativsystemer kan du verifisere signaturen av hash-filen ved å eksekvere følgende kommando i en terminal:
nl: Op alle besturingssystemen kun je de ondertekening van het hasbestand controleren door de volgende opdracht te geven in een terminal:
ru: В случае со всеми операционными системами следует проверить подпись хеш-файла, введя следующую команду в консоль:

source: If the file is authentic, the output will look like this:
ar: إذا كان الملف صحيح ، سيبدو الناتج كما يلي:
fr: Si le fichier est authentique, la sortie ressemblera à ceci :
nb_no: Hvis filen er autentisk, vil utdataen se slik ut:
nl: Als het bestand authentiek is, ziet de uitvoer er als volgt uit:
ru: Если файл является аутентичным (подлинным), выход будет выглядеть так:

source: If your output shows **Good signature**, as in the example, then you may proceed.
ar: إذا كان الناتج يُظهر ** Good signature ** كما هو موضح في المثال فيمكنك المتابعة.
fr: Si votre sortie affiche **Good signature** comme dans l'exemple, alors vous pouvez continuer.
nb_no: Dersom utdataen viser **Good signature**, som i eksempelet, kan du fortsette.
nl: Als er **Good signature** in de uitvoer staat, zoals in het voorbeeld, kun je verder gaan.
ru: Если в выходе видно, что подпись является **ПРАВИЛЬНОЙ**, как в примере, показанном выше, можно продолжать.

source: If you see **BAD signature** in the output, **DO NOT CONTINUE.** Instead delete the file `hashes.txt` and go back to [section 3.1](#31-get-hash-file).
ar: إذا كان الناتج **BAD signature** **لا تُكمل** بل قم بحذف ملف `hashes.txt` وإرجع إلي [القسم 3.1](#31-get-hash-file).
fr: Si vous voyez **BAD signature** dans la sortie, **NE POURSUIVEZ PAS.** Au lieu de cela, supprimez le fichier `hashes.txt` et retournez à la [rubrique 3.1](#31-télécharger-le-fichier-de-hachage).
nb_no: Dersom du ser **BAD signature** i utdataen, **IKKE FORTSETT.** Slett istedenfor `hashes.txt`-filen og gå tilbake til [seksjon 3.1](#31-get-hash-file).
nl: **GA NIET VERDER** als er **BAD signature** in de uitvoer staat. Verwijder dan het bestand `hashes.txt` en ga terug naar [paragraaf 3.1](#31-get-hash-file).
ru: Если подпись в выходе является **НЕПРАВИЛЬНОЙ**, **ПРОДОЛЖАТЬ НЕ СЛЕДУЕТ.** Необходимо удалить файл `hashes.txt` и вернуться к [пункту 3.1](#31-get-hash-file).

source: ## 4. Download and Verify Binary
ar: ## 4. تحميل & تأكد من ملفات التسطيب
fr: ## 4. Télécharger et Vérifier les binaires
nb_no: ## 4. Nedlasting og verifisering av binærfiler
nl: ## 4. Binary downloaden en verifiëren
ru: ## 4. Загрузка и верификация двоичного файла

source: This section will cover downloading the MKEcoin binary for your operating system, getting the `SHA256` hash of your download, and verifying that it is correct.
ar: سيغطي هذا القسم تنزيل برنامج مونيرو لنظام التشغيل الخاص بك ، والحصول على هاش `SHA256` من التنزيل الخاص بك ، والتحقق من صحته.
fr: Cette rubrique couvre le téléchargement du binaire MKEcoin pour votre système d'exploitation, la récupération du hachage `SHA256` de votre téléchargement et la vérification de son authenticité.
nb_no: Denne delen tar for seg nedlasting av MKEcoin-binærfilen for operativsystemet ditt, å få `SHA256`-hashen til nedlastingen din, og å verifisere at den er autentisk.
nl: In dit gedeelte leggen we uit hoe je de MKEcoin-binary voor je besturingssysteem downloadt, de `SHA256`-hash van je download ophaalt en verifieert dat deze correct is.
ru: Этот раздел посвящён загрузке подходящего для вашей операционной системы двоичного файла MKEcoin, получению хеша `SHA256` для загруженного файла, а также проверки правильности этого файла.

source: ### 4.1. Get MKEcoin binary
ar: ### 4.1. الحصول علي ملفات التسطيب
fr: ### 4.1. Télécharger les binaires MKEcoin
nb_no: ### 4.1. Å få tak i MKEcoin-binærfilene
nl: ### 4.1. MKEcoin-binary ophalen
ru: ### 4.1. Получение двоичного файла MKEcoin

source: On Windows or Mac, go to [getMKEcoin.org]({{ site.baseurl_root }}/downloads/) and download the correct file for your operating system. Save the file to your home directory. **Do not extract the files yet.**
ar: علي ويندوز أو ماك توجه إلي [getMKEcoin.org]({{ site.baseurl }}/downloads/) وقم بتنزيل الملف الخاص بنظام التشغيل الخاص بك. قم بحفظ الملف لمجلدك الرئيسي. **لا تقم بفك الضغط **
fr: Sur Windows et Mac, rendez-vous sur [getMKEcoin.org](https://getMKEcoin.org/fr/downloads/) et téléchargez le fichier correspondant à votre système d'exploitation. enregistrez ce fichier dans votre répertoire utilisateur. **N'extrayez pas les fichiers pour le moment.**
nb_no: På Windows eller Mac, gå til [getMKEcoin.org]({{ site.baseurl_root }}/downloads/) og last ned den riktige filen for operativsystemet ditt. Lagre filen til hjemkatalogen din. **Ikke pakk ut filene enda.**
nl: Op Windows of een Mac ga je naar [getMKEcoin.org]({{ site.baseurl }}/downloads/) en download je het juiste bestand voor je besturingssysteem. Sla het bestand op in je homedirectory. **Pak de bestanden nog niet uit.**
ru: Если установлена операционная система Windows или Mac, необходимо перейти на [getMKEcoin.org]({{ site.baseurl_root }}/downloads/) и загрузить соответствующий используемой операционной системе файл, после чего сохранить его в домашней директории. **На данном этапе файлы извлекать не следует.**

source: On Linux, you can download the command line tools by issuing the following command:
ar: في Linux ، يمكنك تنزيل واجهه سطر الأوامر عن طريق إصدار الأمر التالي:
fr: Sur Linux, vous pouvez télécharger les outils ligne de commande avec la commande suivante :
nb_no: På Linux kan du laste ned kommandolinjeverktøyene ved å eksekvere følgende kommando:
nl: Op Linux kun je de opdrachtregelversie downloaden door de volgende opdracht op te geven:
ru: Для Linux можно загрузить инструменты командной строки, используя следующую команду:

source: ### 4.2. Binary Verification on Linux or Mac
ar: ### 4.2. تأكد من الملفات علي ليُنكس اوماك
fr: ### 4.2. Vérifier les binaires sur Linux et Mac
nb_no: ### 4.2. Verifisering av binærfiler på Linux eller Mac
nl: ### 4.2. Binary verifiëren op Linux of Mac
ru: ### 4.2. Верификация двоичного файла под Linux и Mac

source: The steps for both Linux and Mac are the same. From a terminal, get the `SHA256` hash of your downloaded MKEcoin binary. As an example this guide will use the `Linux, 64bit` GUI binary. Substitute `MKEcoin-gui-linux-x64-v0.15.0.1.tar.bz2` with the name of the binary that you downloaded in [section 4.1](#41-get-MKEcoin-binary).
ar: هذه الخطوات لنظامي تشغيل لينُكس وماك. من سطر الأوامر إحصل علي هاش `SHA256` لملف التثبيت. كمثال سيستخدم هذا الدليل واجهه المستخدم الرسوميه علي ليُنكس , إستبدل `MKEcoin-gui-linux-x64-v0.15.0.1.tar.bz2` بإسم ملف التثبيت الذي قمت بتنزيله في [الفصل 4.1](#41-get-MKEcoin-binary).
fr: Les étapes pour Linux et Mac sont les mêmes. Depuis un terminal, récupérez le hachage `SHA256` du binaire MKEcoin téléchargé. A titre d'exemple, ce guide utilisera le binaire GUI `Linux, 64bit`. Remplacez `MKEcoin-gui-linux-x64-v0.15.0.1.tar.bz2` par le nom du binaire que vous aurez téléchargé dans la [rubrique 4.1](#41-télécharger-les-binaires-MKEcoin).
nb_no: Trinnene for både Linux og Mac er de samme. Fra en terminal, få `SHA256`-hashen til den nedlastede MKEcoin-binærfilen din. Som et eksempel vil denne veiledningen bruke `Linux, 64bit`-GUI-binærfilen. Bytt ut `MKEcoin-gui-linux-x64-v0.15.0.1.tar.bz2` med navnet på binærfilen som du lastet ned i [seksjon 4.1](#41-get-MKEcoin-binary).
nl: De stappen op zowel Linux als Mac zijn hetzelfde. In een terminal bereken je de `SHA256`-hash van je gedownloade MKEcoin-binary. Als voorbeeld gebruiken we hier het binaire bestand voor 64-bits Linux. Vervang `MKEcoin-gui-linux-x64-v0.15.0.1.tar.bz2` door de naam van het binaire bestand dat je hebt gedownload in [paragraaf 4.1](#41-get-MKEcoin-binary).
ru: Этапы проверки для Linux и Mac ничем не отличаются. Используя консоль, необходимо получить хеш `SHA256` загруженного двоичного файла MKEcoin. Для примера в этом руководстве взят двоичный файл для `Linux 64-bit` GUI. Следует заменить `MKEcoin-gui-linux-x64-v0.15.0.1.tar.bz2` на имя двоичного файла, загруженного в соответствии с [пунктом 4.1](#41-get-MKEcoin-binary).

source: ``` shasum -a 256 MKEcoin-linux-x64-v0.15.0.1.tar.bz2 ```
ar: ``` shasum -a 256 MKEcoin-gui-linux-x64-v0.15.0.1.tar.bz2 ```

source: The output will look like this, but will be different for each binary file. Your `SHA256` hash should match the one listed in the `hashes.txt` file for your binary file.
ar: سيبدو الناتج كهذا ، ولكن سيكون مختلفًا لكل ملف. يجب أن يتطابق هاش `SHA256` الخاصة بك مع الهاش في القائمة المدرجة في ملف` hashes.txt` لملف التثبيت.
fr: La sortie ressemblera à ceci, mais sera différente pour chaque binaire. Votre hachage `SHA256` deoit correspondre à celui indiqué dans le fichier `hashes.txt` pour votre binaire.
nb_no: Utdataen vil se slik ut, men den vil være forskjellige for hver binærfil. Din `SHA256`-hash bør matche den som er oppført i `hashes.txt`-filen for din binærfil.
nl: De uitvoer ziet er uit als volgt, maar met verschillende details per binair bestand. Je `SHA256`-hash moet overeenkomen met de hash in het bestand `hashes.txt` van je binaire bestand.
ru: Выход должен выглядеть так, как показано, но при этом он будет отличаться в случае с каждым двоичным файлом. Хеш `SHA256` должен соответствовать указанному в файле `hashes.txt` двоичного файла.

source: ``` 8d61f992a7e2dbc3d753470b4928b5bb9134ea14cf6f2973ba11d1600c0ce9ad MKEcoin-linux-x64-v0.15.0.1.tar.bz2 ```
ar: ``` fb0f43387b31202f381c918660d9bc32a3d28a4733d391b1625a0e15737c5388 MKEcoin-gui-linux-x64-v0.15.0.1.tar.bz2 ```

source: If your hash **DOES** match, then you are finished with the guide! You can extract the files and install.
ar: إذا كان الهاش **مُتطابق** يمكنك الأن فك الضفط والتثبيت.
fr: Si votre hachage **EST** identique vous en avez terminé avec la vérification ! Vous pouvez extraire et installer les fichiers.
nb_no: Dersom hashen din **MATCHER**, er du ferdig med veiledningen! Du kan pakke ut filene og installere.
nl: Als de hash **WEL** overeenkomt, ben je klaar met deze handleiding! Dan kun je de bestanden uitpakken en installeren.
ru: При **СОВПАДЕНИИ** хеша можно завершить работу с настоящим руководством! Теперь файлы можно извлечь и установить.

source: If your hash **DOES NOT** match, **DO NOT CONTINUE.** Instead delete the binary you downloaded and go back to [section 4.1](#41-get-MKEcoin-binary).
ar: إذا كان الهاش **غير مُتطابق** , ** لا تُكمل ** بل إحذف ملف التثبيت وإرجع إلي [القسم 4.1](#41-get-MKEcoin-binary).
fr: Si votre hachage **N'EST PAS** identique, **NE POURSUIVEZ PAS.** Au lieu de cela, supprimez le binaire que vous avez téléchargé et retournez à la [rubrique 4.1](#41-télécharger-les-binaires-MKEcoin).
nb_no: Dersom hashen din **IKKE MATCHER**, **IKKE FORTSETT.** Slett i stedet binærfilen du lastet ned og gå tilbake til [seksjon 4.1](#41-get-MKEcoin-binary).
nl: **GA NIET VERDER** als de hash **NIET** overeenkomt. Verwijder dan de binary die je hebt gedowload en ga terug naar [paragraaf 4.1](#41-get-MKEcoin-binary).
ru: В случае **НЕСОВПАДЕНИЯ** хеша, **ПРОДОЛЖАТЬ НЕ СЛЕДУЕТ.** Необходимо удалить загруженный двоичный файл и вернуться к [пункту 4.1](#41-get-MKEcoin-binary).

source: ### 4.3. Binary Verification on Windows
ar: ### 4.3. تأكد من الملفات علي ويندوز
fr: ### 4.3. Vérifier les binaires sur Windows
nb_no: ### 4.3. Verifisering av binærfiler på Windows
nl: ### 4.3. Binary verifiëren op Windows
ru: ### 4.3. Верификация двоичного файла под Windows

source: From a terminal, get the `SHA256` hash of your downloaded MKEcoin binary. As an example this guide will use the `Windows, 64bit` GUI binary. Substitute `MKEcoin-gui-win-x64-v0.15.0.1.zip` with the name of the binary that you downloaded in [section 4.1](#41-get-MKEcoin-binary).
ar: من سطر الأوامر احصل على هاش `SHA256` من ملف التثبيت الذي تم تنزيله. على سبيل المثال ، سيستخدم هذا الدليل ثنائي واجهة المستخدم الرسومية لنظام ويندوز ، 64 بت. استبدل `MKEcoin-gui-win-x64-v0.15.0.1.zip` باسم الملف الذي قمت بتنزيله في [القسم 4.1](#41-get-MKEcoin-binary).
fr: Depuis un terminal, récupérez le hachage `SHA256` du binaire MKEcoin téléchargé. A titre d'exemple, ce guide utilisera le binaire GUI `Windows, 64bit`. Remplacez `MKEcoin-gui-win-x64-v0.12.0.0.zip` par le nom du binaire que vous aurez téléchargé dans la [rubrique 4.1](#41-télécharger-les-binaires-MKEcoin).
nb_no: Åpne en terminal og få `SHA256`-hash til din nedlastede MKEcoin-binærfil. Som et eksempel, vil denne veiledningen bruke `Windows, 64bit`-GUI-binærfilen. Bytt ut `MKEcoin-gui-win-x64-v0.15.0.1.zip` med navnet på binæren som du lastet ned i [seksjon 4.1](#41-get-MKEcoin-binary).
nl: In een terminal bereken je de `SHA256`-hash van je gedownloade MKEcoin-binary. Als voorbeeld gebruiken we hier het binaire bestand voor de 64-bits Windows GUI. Vervang `MKEcoin-gui-win-x64-v0.12.0.0.zip` door de naam van het binaire bestand dat je hebt gedownload in [paragraaf 4.1](#41-get-MKEcoin-binary).
ru: Используя терминал, необходимо получить хеш `SHA256` загруженного двоичного файла MKEcoin. Для примера в этом руководстве взят двоичный файл для `Windows, 64bit` GUI. Следует заменить `MKEcoin-gui-win-x64-v0.15.0.1.zip` на имя двоичного файла, загруженного в соответствии с [пунктом 4.1](#41-get-MKEcoin-binary).

source: ``` certUtil -hashfile MKEcoin-gui-win-x64-v0.15.0.1.zip SHA256 ```
ar: ``` certUtil -hashfile MKEcoin-gui-win-x64-v0.12.0.0.zip SHA256 ```
